kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/app_match_nuttx/nuttx/arch/arm/src/hc32/hc32_serial.c
      .ops       = &g_uart_ops,
      .priv     = &g_uart5priv,
    },

  .irq            = HC32_IRQ_UART5,
  .parity         = CONFIG_UART5_PARITY,
  .bits           = CONFIG_UART5_BITS,
  .stopbits2      = CONFIG_UART5_2STOP,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_UART5_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = GPIO_UART5_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART5_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = GPIO_UART5_RTS,
#endif
  .baud           = CONFIG_UART5_BAUD,
  .apbclock       = HC32_PCLK1_FREQUENCY,
  .usartbase      = HC32_UART5_BASE,
  .tx_gpio        = GPIO_UART5_TX,
  .rx_gpio        = GPIO_UART5_RX,

#ifdef CONFIG_UART5_RS485
  .rs485_dir_gpio = GPIO_UART5_RS485_DIR,
#  if (CONFIG_UART5_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
};
#endif

/* This describes the state of the HC32 USART6 port. */

#ifdef CONFIG_UART6_SERIALDRIVER

/* UART RX/TX Port/Pin definition */
#define USART_RX_PORT                   (GPIO_PORT_H)   /* PH6: USART6_RX */
#define USART_RX_PIN                    (GPIO_PIN_06)
#define USART_RX_FUNC                   (GPIO_FUNC_37_USART6_RX)

#define USART_TX_PORT                   (GPIO_PORT_E)   /* PE6: USART6_TX */
#define USART_TX_PIN                    (GPIO_PIN_06)
#define USART_TX_FUNC                   (GPIO_FUNC_36_USART6_TX)

/* UART unit definition */
#define USART_UNIT                      (M4_USART6)
#define USART_CLK_GATE                  (PWC_FCG3_USART6)

/* UART unit interrupt definition */
#define USART_UNIT_ERR_INT_SRC          (INT_USART6_EI)
#define USART_UNIT_ERR_INT_IRQn         (Int011_IRQn + HC32_IRQ_FIRST)

#define USART_UNIT_RX_INT_SRC           (INT_USART6_RI)
#define USART_UNIT_RX_INT_IRQn          (Int012_IRQn + HC32_IRQ_FIRST)

#define USART_UNIT_TX_INT_SRC           (INT_USART6_TI)
#define USART_UNIT_TX_INT_IRQn          (Int013_IRQn + HC32_IRQ_FIRST)

#define USART_UNIT_TCI_INT_SRC          (INT_USART6_TCI)
#define USART_UNIT_TCI_INT_IRQn         (Int014_IRQn + HC32_IRQ_FIRST)

#define GPIO_USART6_TX GPIO_PINSET(USART_TX_PORT, USART_TX_PIN)
#define GPIO_USART6_RX GPIO_PINSET(USART_RX_PORT, USART_RX_PIN)


const stc_usart_uart_init_t usart6config = {
    .u32Baudrate = BSP_PRINTF_BAUDRATE,
    .u32BitDirection = USART_LSB,
    .u32StopBit = USART_STOPBIT_1BIT,
    .u32Parity = USART_PARITY_NONE,
    .u32DataWidth = USART_DATA_LENGTH_8BIT,
    .u32ClkMode = USART_INTERNCLK_OUTPUT,
    .u32PclkDiv = USART_PCLK_DIV64,
    .u32OversamplingBits = USART_OVERSAMPLING_8BIT,
    .u32NoiseFilterState = USART_NOISE_FILTER_DISABLE,
    .u32SbDetectPolarity = USART_SB_DETECT_FALLING,
};


static struct up_dev_s g_usart6priv =
{
  .dev =
    {
#if CONSOLE_UART == 6
      .isconsole = true,
#endif
      .recv     =
      {
        .size   = CONFIG_UART6_RXBUFSIZE,
        .buffer = g_usart6rxbuffer,
      },
      .xmit     =
      {
        .size   = CONFIG_UART6_TXBUFSIZE,
        .buffer = g_usart6txbuffer,
      },
      .ops       = &g_uart_ops,
      .priv     = &g_usart6priv,
    },

  .irq            = USART_UNIT_RX_INT_IRQn,
  .rx_irq         = USART_UNIT_RX_INT_IRQn,
  .tx_irq         = USART_UNIT_TX_INT_IRQn,
  .txc_irq        = USART_UNIT_TCI_INT_IRQn,
  .err_irq        = USART_UNIT_ERR_INT_IRQn,
  .rxint_src      = USART_UNIT_RX_INT_SRC,
  .txint_src      = USART_UNIT_TX_INT_SRC,
  .txcint_src     = USART_UNIT_TCI_INT_SRC,
  .errint_src     = USART_UNIT_ERR_INT_SRC,

  .clk_gate       = USART_CLK_GATE,
  .usartbase      = (uint32_t)USART_UNIT,
  .tx_gpio        = GPIO_USART6_TX,
  .tx_func        = USART_TX_FUNC,
  .rx_gpio        = GPIO_USART6_RX,
  .rx_func        = USART_RX_FUNC,
  .param          =
  {
    .u32Baudrate = BSP_PRINTF_BAUDRATE,
    .u32BitDirection = USART_LSB,
    .u32StopBit = USART_STOPBIT_1BIT,
    .u32Parity = USART_PARITY_NONE,
    .u32DataWidth = USART_DATA_LENGTH_8BIT,
    .u32ClkMode = USART_INTERNCLK_OUTPUT,
    .u32PclkDiv = USART_PCLK_DIV64,
    .u32OversamplingBits = USART_OVERSAMPLING_8BIT,
    .u32NoiseFilterState = USART_NOISE_FILTER_DISABLE,
    .u32SbDetectPolarity = USART_SB_DETECT_FALLING
  },
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_USART6_OFLOWCONTROL)
  .oflow          = true,
  .cts_gpio       = GPIO_USART6_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_USART6_IFLOWCONTROL)
  .iflow          = true,
  .rts_gpio       = GPIO_USART6_RTS,
#endif

#ifdef CONFIG_USART6_RS485
  .rs485_dir_gpio = GPIO_USART6_RS485_DIR,
#  if (CONFIG_USART6_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#  else
  .rs485_dir_polarity = true,
#  endif
#endif
};
#endif

static struct up_dev_s *g_uart_rx_dev = &g_usart6priv;

/* This table lets us iterate over the configured USARTs */

static struct up_dev_s * const g_uart_devs[HC32_NUSART] =
{
#ifdef CONFIG_UART1_SERIALDRIVER
  [0] = &g_usart1priv,
#endif
#ifdef CONFIG_UART2_SERIALDRIVER
  [1] = &g_usart2priv,
#endif
#ifdef CONFIG_UART3_SERIALDRIVER
  [2] = &g_usart3priv,
#endif
#ifdef CONFIG_UART4_SERIALDRIVER
  [3] = &g_uart4priv,
#endif
#ifdef CONFIG_UART5_SERIALDRIVER
  [4] = &g_uart5priv,
#endif
#ifdef CONFIG_UART6_SERIALDRIVER
  [5] = &g_usart6priv,
#endif
#ifdef CONFIG_UART7_SERIALDRIVER
  [6] = &g_uart7priv,
#endif
#ifdef CONFIG_UART8_SERIALDRIVER
  [7] = &g_uart8priv,
#endif
};

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

void hc32_rx_irq_cb(void)
{
    up_interrupt(g_uart_rx_dev->rx_irq, NULL, g_uart_rx_dev);
}

void hc32_tx_irq_cb(void)
{
    up_interrupt(g_uart_rx_dev->tx_irq, NULL, g_uart_rx_dev);
}

void hc32_txc_irq_cb(void)
{
    up_interrupt(g_uart_rx_dev->txc_irq, NULL, g_uart_rx_dev);
}

void hc32_err_irq_cb(void)
{
    up_interrupt(g_uart_rx_dev->err_irq, NULL, g_uart_rx_dev);
}


static int hc32_err_irq_handler(int irq, FAR void *context, FAR void *arg)
{
    up_irq_save();
    IRQ011_Handler();
    return 0;
}

