kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/app_match_nuttx/nuttx/arch/arm/src/hc32/hc32_serial.c
static int hc32_rx_irq_handler(int irq, FAR void *context, FAR void *arg)
{
    up_irq_save();
    IRQ012_Handler();
    return 0;
}

static int hc32_tx_irq_handler(int irq, FAR void *context, FAR void *arg)
{
    up_irq_save();
    IRQ013_Handler();
    return 0;
}

static int hc32_tci_irq_handler(int irq, FAR void *context, FAR void *arg)
{
    up_irq_save();
    IRQ014_Handler();
    return 0;
}

int hc32_print(const char *fmt, ...)
{
    int i, ret;
    va_list ap;
    char buf[256];

    memset(buf, 0, sizeof(buf));
    va_start(ap, fmt);
    ret = vsnprintf(buf, 255, fmt, ap);
    va_end(ap);
    USART_FuncCmd(USART_UNIT, USART_RX | USART_TX, Enable);

    arm_lowputc('-');
    arm_lowputc(' ');

    for (i = 0; i < strlen(buf); i++)
    {
        arm_lowputc((uint16_t)*(buf + i));
    }
    return ret;
}

/**
 * @brief  Instal IRQ handler.
 * @param  [in] pstcConfig      Pointer to struct @ref stc_irq_signin_config_t
 * @param  [in] u32Priority     Interrupt priority
 * @retval None
 */
static void hc32_serial_enableirq(const stc_irq_signin_config_t *pstcConfig,
                                    uint32_t u32Priority)
{
    if (NULL != pstcConfig)
    {
        (void)INTC_IrqSignIn(pstcConfig);
        NVIC_ClearPendingIRQ(pstcConfig->enIRQn);
        NVIC_SetPriority(pstcConfig->enIRQn, u32Priority);
        NVIC_EnableIRQ(pstcConfig->enIRQn);
    }
}

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->usartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value)
{
  putreg32(value, priv->usartbase + offset);
}


/****************************************************************************
 * Name: up_setusartint
 ****************************************************************************/

static inline void up_setusartint(struct up_dev_s *priv, uint16_t ie)
{
  uint32_t cr;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* And restore the interrupt state (see the interrupt enable/usage
   * table above)
   */

  cr  = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR1));
  cr &= ~(USART_CR1_USED_INTS);
  cr |= (ie & (USART_CR1_USED_INTS));
  up_serialout(priv, offsetof(M4_USART_TypeDef, _CR1), cr);

//  cr  = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR3));
//  cr &= ~USART_CR3_EIE;
//  cr |= (ie & USART_CR3_EIE);
//  up_serialout(priv, base->_CR3, cr);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void up_restoreusartint(struct up_dev_s *priv, uint16_t ie)
{
  irqstate_t flags;

  flags = enter_critical_section();

  up_setusartint(priv, ie);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: up_disableusartint
 ****************************************************************************/

static void up_disableusartint(struct up_dev_s *priv, uint16_t *ie)
{
  irqstate_t flags;

  flags = enter_critical_section();

  if (ie)
    {
      uint32_t cr1;

      /* USART interrupts:
       *
       * Enable             Status          Meaning                Usage
       * ------------------ --------------- ---------------------- ----------
       * USART_CR1_IDLEIE   USART_SR_IDLE   Idle Line Detected     (not used)
       * USART_CR1_RXNEIE   USART_SR_RXNE   Rx Data Ready
       * "              "   USART_SR_ORE    Overrun Error Detected
       * USART_CR1_TCIE     USART_SR_TC     Transmission Complete  (RS-485)
       * USART_CR1_TXEIE    USART_SR_TXE    Tx Data Register Empty
       * USART_CR1_PEIE     USART_SR_PE     Parity Error
       *
       * USART_CR2_LBDIE    USART_SR_LBD    Break Flag             (not used)
       * USART_CR3_EIE      USART_SR_FE     Framing Error
       * "           "      USART_SR_NE     Noise Error
       * "           "      USART_SR_ORE    Overrun Error Detected
       * USART_CR3_CTSIE    USART_SR_CTS    CTS flag               (not used)
       */

      cr1 = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR1));
      *ie = cr1 & (USART_CR1_USED_INTS);
    }

  /* Disable all interrupts */

  up_setusartint(priv, 0);

  leave_critical_section(flags);
}


/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the USART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/
static int up_setup(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;

#ifndef CONFIG_SUPPRESS_UART_CONFIG
    uint32_t regval;

    /* Note: The logic here depends on the fact that that the USART module
     * was enabled in stm32_lowsetup().
     */

    /* Enable USART APB1/2 clock */

//    up_set_apb_clock(dev, true);

    /* Configure pins for USART use */

    hc32_configgpio(priv->tx_gpio);
    hc32_configgpio(priv->rx_gpio);

#ifdef CONFIG_SERIAL_OFLOWCONTROL
    if (priv->cts_gpio != 0)
      {
        hc32_configgpio(priv->cts_gpio);
      }
#endif

#ifdef CONFIG_SERIAL_IFLOWCONTROL
    if (priv->rts_gpio != 0)
      {
        uint32_t config = priv->rts_gpio;

#ifdef CONFIG_STM32_FLOWCONTROL_BROKEN
        /* Instead of letting hw manage this pin, we will bitbang */

        config = (config & ~GPIO_MODE_MASK) | GPIO_OUTPUT;
#endif
        hc32_configgpio(config);
      }
#endif

#ifdef HAVE_RS485
    if (priv->rs485_dir_gpio != 0)
      {
        hc32_configgpio(priv->rs485_dir_gpio);
        hc32_gpiowrite(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
      }
#endif

