kirakiseki/ECGMonitor-XiUOS/xiuos/Ubiquitous/Nuttx_Fusion_XiUOS/app_match_nuttx/nuttx/arch/arm/src/hc32/hc32_serial.c
    /* Configure CR2
     * Clear STOP, CLKEN, CPOL, CPHA, LBCL, and interrupt enable bits
     */

    regval  = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR2));
    regval &= ~(USART_CR2_STOP | USART_CR2_CLKC | USART_CR2_WKUPIE |
                USART_CR2_BEIE | USART_CR2_LBDIE | USART_CR2_LBDIE);

    /* Configure STOP bits */

    if (priv->stopbits2)
      {
        regval |= USART_CR2_STOP;
      }

    up_serialout(priv, offsetof(M4_USART_TypeDef, _CR2), regval);

    /* Configure CR1
     * Clear TE, REm and all interrupt enable bits
     */

    regval  = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR1));
    regval &= ~(USART_CR1_TE | USART_CR1_RE | USART_CR1_RTOE);

    up_serialout(priv, offsetof(M4_USART_TypeDef, _CR1), regval);

    /* Configure CR3
     * Clear CTSE, RTSE, and all interrupt enable bits
     */

    regval  = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR3));
    regval &= ~(USART_CR3_CTSE | USART_CR3_RTSE );

    up_serialout(priv, offsetof(M4_USART_TypeDef, _CR3), regval);

    /* Configure the USART line format and speed. */

//    up_set_format(dev);

    /* Enable Rx, Tx, and the USART */

    regval      = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR1));

    regval     |= (USART_CR1_RTOE | USART_CR1_RTOIE | USART_CR1_TE |
        USART_CR1_RE | USART_CR1_RIE | USART_CR1_TXEIE | USART_CR1_TCIE);

    up_serialout(priv, offsetof(M4_USART_TypeDef, _CR1), regval);

#endif /* CONFIG_SUPPRESS_UART_CONFIG */


  /* Set up the cached interrupt enables value */

  priv->ie = 0;

  /* Mark device as initialized. */

  priv->initialized = true;

  return OK;
}

/****************************************************************************
 * Name: up_shutdown
 *
 * Description:
 *   Disable the USART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void up_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint32_t regval;

  /* Mark device as uninitialized. */

  priv->initialized = false;

  /* Disable all interrupts */

  up_disableusartint(priv, NULL);

  /* Disable Rx, Tx, and the UART */

  regval  = up_serialin(priv, offsetof(M4_USART_TypeDef, _CR1));
  regval &= ~( USART_CR1_TE | USART_CR1_RE);
  up_serialout(priv, offsetof(M4_USART_TypeDef, _CR1), regval);

  /* Release pins. "If the serial-attached device is powered down, the TX
   * pin causes back-powering, potentially confusing the device to the point
   * of complete lock-up."
   *
   * REVISIT:  Is unconfiguring the pins appropriate for all device?  If not,
   * then this may need to be a configuration option.
   */

  hc32_unconfiggpio(priv->tx_gpio);
  hc32_unconfiggpio(priv->rx_gpio);

#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->cts_gpio != 0)
    {
      hc32_unconfiggpio(priv->cts_gpio);
    }
#endif

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->rts_gpio != 0)
    {
      hc32_unconfiggpio(priv->rts_gpio);
    }
#endif

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      hc32_unconfiggpio(priv->rs485_dir_gpio);
    }
#endif
}

/****************************************************************************
 * Name: up_attach
 *
 * Description:
 *   Configure the USART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate
 *   in a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int up_attach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  stc_irq_signin_config_t cfg;

  memset(&cfg, 0, sizeof(cfg));
  cfg.enIRQn = priv->rx_irq - HC32_IRQ_FIRST;
  cfg.enIntSrc = priv->rxint_src;
  cfg.pfnCallback = &hc32_rx_irq_cb;
  hc32_serial_enableirq(&cfg, DDL_IRQ_PRIORITY_DEFAULT);

  memset(&cfg, 0, sizeof(cfg));
  cfg.enIRQn = priv->tx_irq - HC32_IRQ_FIRST;
  cfg.enIntSrc = priv->txint_src;
  cfg.pfnCallback = &hc32_tx_irq_cb;
  hc32_serial_enableirq(&cfg, DDL_IRQ_PRIORITY_DEFAULT);

  memset(&cfg, 0, sizeof(cfg));
  cfg.enIRQn = priv->txc_irq - HC32_IRQ_FIRST;
  cfg.enIntSrc = priv->txcint_src;
  cfg.pfnCallback = &hc32_txc_irq_cb;
  hc32_serial_enableirq(&cfg, DDL_IRQ_PRIORITY_DEFAULT);

  memset(&cfg, 0, sizeof(cfg));
  cfg.enIRQn = priv->err_irq - HC32_IRQ_FIRST;
  cfg.enIntSrc = priv->errint_src;
  cfg.pfnCallback = &hc32_err_irq_cb;
  hc32_serial_enableirq(&cfg, DDL_IRQ_PRIORITY_DEFAULT);

  irq_attach(HC32_IRQ_SVCALL, arm_svcall, NULL);
  irq_attach(HC32_IRQ_HARDFAULT, arm_hardfault, NULL);
  irq_attach(USART_UNIT_ERR_INT_IRQn, hc32_err_irq_handler, NULL);
  irq_attach(USART_UNIT_RX_INT_IRQn, hc32_rx_irq_handler, NULL);
  irq_attach(USART_UNIT_TX_INT_IRQn, hc32_tx_irq_handler, NULL);
  irq_attach(USART_UNIT_TCI_INT_IRQn, hc32_tci_irq_handler, NULL);
  return OK;
}

/****************************************************************************
 * Name: up_detach
 *
 * Description:
 *   Detach USART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void up_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  up_disable_irq(priv->rx_irq);
  irq_detach(priv->rx_irq);
  up_disable_irq(priv->tx_irq);
  irq_detach(priv->tx_irq);
  up_disable_irq(priv->txc_irq);
  irq_detach(priv->txc_irq);
  up_disable_irq(priv->err_irq);
  irq_detach(priv->err_irq);
}

/****************************************************************************
 * Name: up_interrupt
 *
 * Description:
 *   This is the USART interrupt handler.  It will be invoked when an
 *   interrupt received on the 'irq'  It should call uart_transmitchars or
 *   uart_receivechar to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'irq' number into the
 *   appropriate uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int up_interrupt(int irq, void *context, void *arg)
{
  struct up_dev_s *priv = (struct up_dev_s *)arg;
  int  passes;
  bool handled;

  DEBUGASSERT(priv != NULL);

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  handled = true;
  for (passes = 0; passes < 256 && handled; passes++)
    {
      handled = false;

      /* Get the masked USART status word. */

